In [1]:
import pandas as pd

In [4]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung']}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name'])

In [5]:
raw_datab = {
        'subject_id': ['1', '1', '1', '2','2'],
        'address': ['a1', 'a2', 'a3', 'a4', 'a4']}
df_b = pd.DataFrame(raw_datab, columns = ['subject_id', 'address'])

In [7]:
df_b

  subject_id address
0          1      a1
1          1      a2
2          1      a3
3          2      a4
4          2      a4

In [6]:
pd.merge(df_a, df_b, on='subject_id')

  subject_id first_name address
0          1       Alex      a1
1          1       Alex      a2
2          1       Alex      a3
3          2        Amy      a4
4          2        Amy      a4